Autodesk.Revit.DB.ExportColorMode
An enumerated type listing export color mode.

Autodesk.Revit.DB.ExportColorMode.TrueColorPerView
All colors from the Revit project will be exported as 24-bit RGB values as specified in view.

Autodesk.Revit.DB.ExportColorMode.TrueColor
All colors from the Revit project will be exported as 24-bit RGB values as specified in object styles.

Autodesk.Revit.DB.ExportColorMode.IndexColors
All colors from the Revit project will be set to the closest of the 255 AutoCAD Color Index colors.